<!DOCTYPE html>
<html lang="en-us">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
    
    <title>Knowledge Graphs 3 - Using a Triple Store | The Wandering Glitch</title>
    <meta name="viewport" content="width=device-width,minimum-scale=1">
    <meta name="description" content="Last time I showed you how to use CLI tools to build out your RDF data to more depth using Turtle files and how to query it using the Apache Jena CLI toolchain using SPARQL Query language. This time I&rsquo;ll show how to insert and retrieve data from a remote triple store. I&rsquo;ll continue using the CLI tools for now.
 Knowledge Graphs 101 Knowledge Graphs 2 – Playing on the CLI Knowledge Graphs 3 – Using a Triple Store Knowledge Graphs 4 – Querying your knowledge graph using .">
    <meta name="generator" content="Hugo 0.92.2" />
    
    
    
    
      <meta name="robots" content="noindex, nofollow">
    

    
<link rel="stylesheet" href="/ananke/css/main.min.css" >



    
    
    
      

    

    
    
    <meta property="og:title" content="Knowledge Graphs 3 - Using a Triple Store" />
<meta property="og:description" content="Last time I showed you how to use CLI tools to build out your RDF data to more depth using Turtle files and how to query it using the Apache Jena CLI toolchain using SPARQL Query language. This time I&rsquo;ll show how to insert and retrieve data from a remote triple store. I&rsquo;ll continue using the CLI tools for now.
 Knowledge Graphs 101 Knowledge Graphs 2 – Playing on the CLI Knowledge Graphs 3 – Using a Triple Store Knowledge Graphs 4 – Querying your knowledge graph using ." />
<meta property="og:type" content="article" />
<meta property="og:url" content="http://45.89.107.9/posts/knowledge-graphs-3-using-a-triple-store/" /><meta property="article:section" content="posts" />
<meta property="article:published_time" content="2019-09-13T00:00:00+00:00" />
<meta property="article:modified_time" content="2019-09-13T00:00:00+00:00" />

<meta itemprop="name" content="Knowledge Graphs 3 - Using a Triple Store">
<meta itemprop="description" content="Last time I showed you how to use CLI tools to build out your RDF data to more depth using Turtle files and how to query it using the Apache Jena CLI toolchain using SPARQL Query language. This time I&rsquo;ll show how to insert and retrieve data from a remote triple store. I&rsquo;ll continue using the CLI tools for now.
 Knowledge Graphs 101 Knowledge Graphs 2 – Playing on the CLI Knowledge Graphs 3 – Using a Triple Store Knowledge Graphs 4 – Querying your knowledge graph using ."><meta itemprop="datePublished" content="2019-09-13T00:00:00+00:00" />
<meta itemprop="dateModified" content="2019-09-13T00:00:00+00:00" />
<meta itemprop="wordCount" content="1306">
<meta itemprop="keywords" content="" /><meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="Knowledge Graphs 3 - Using a Triple Store"/>
<meta name="twitter:description" content="Last time I showed you how to use CLI tools to build out your RDF data to more depth using Turtle files and how to query it using the Apache Jena CLI toolchain using SPARQL Query language. This time I&rsquo;ll show how to insert and retrieve data from a remote triple store. I&rsquo;ll continue using the CLI tools for now.
 Knowledge Graphs 101 Knowledge Graphs 2 – Playing on the CLI Knowledge Graphs 3 – Using a Triple Store Knowledge Graphs 4 – Querying your knowledge graph using ."/>

	
  </head>

  <body class="ma0 avenir bg-near-white">

    
   
  

  <header>
    <div class="bg-black">
      <nav class="pv3 ph3 ph4-ns" role="navigation">
  <div class="flex-l justify-between items-center center">
    <a href="/" class="f3 fw2 hover-white no-underline white-90 dib">
      
        The Wandering Glitch
      
    </a>
    <div class="flex-l items-center">
      

      
      
<div class="ananke-socials">
  
</div>

    </div>
  </div>
</nav>

    </div>
  </header>



    <main class="pb7" role="main">
      
  
  <article class="flex-l flex-wrap justify-between mw8 center ph3">
    <header class="mt4 w-100">
      <aside class="instapaper_ignoref b helvetica tracked">
          
        POSTS
      </aside>
      










  <div id="sharing" class="mt3 ananke-socials">
    
  </div>


      <h1 class="f1 athelas mt3 mb1">Knowledge Graphs 3 - Using a Triple Store</h1>
      
      <p class="tracked">
        By <strong>aabs</strong>
      </p>
      
      
      
      <time class="f6 mv4 dib tracked" datetime="2019-09-13T00:00:00Z">September 13, 2019</time>
      

      
      
    </header>
    <div class="nested-copy-line-height lh-copy serif f4 nested-links mid-gray pr4-l w-two-thirds-l"><p><a href="https://andrewmatthews.blog/2019/09/13/knowledge-graphs-2-playing-on-the-cli/">Last time</a> I showed you how to use CLI tools to build out your RDF data to more depth using Turtle files and how to query it using the Apache Jena CLI toolchain using SPARQL Query language. This time I&rsquo;ll show how to insert and retrieve data from a remote triple store. I&rsquo;ll continue using the CLI tools for now.</p>
<ul>
<li><a href="https://andrewmatthews.blog/2019/09/12/knowledge-graphs-101/">Knowledge Graphs 101</a></li>
<li><a href="https://andrewmatthews.blog/2019/09/13/knowledge-graphs-2-playing-on-the-cli/">Knowledge Graphs 2 – Playing on the CLI</a></li>
<li><a href="https://andrewmatthews.blog/2019/09/13/knowledge-graphs-3-using-a-triple-store/">Knowledge Graphs 3 – Using a Triple Store</a></li>
<li><a href="https://andrewmatthews.blog/2019/09/16/knowledge-graphs-4-querying-your-knowledge-graph-using-net/">Knowledge Graphs 4 – Querying your knowledge graph using .NET</a></li>
<li><a href="https://andrewmatthews.blog/2019/10/03/knowledge-graphs-5-modelling-with-rdfs/">Knowledge Graphs 5 – Modelling with RDFS</a></li>
<li><a href="https://andrewmatthews.blog/2019/10/03/knowledge-graphs-6-semantics/">Knowledge Graphs 6 - Semantics</a></li>
<li><a href="https://aabs.wordpress.com/2019/11/06/knowledge-graphs-7-named-graphs/">Knowledge Graphs 7 - Named graphs</a></li>
</ul>
<h2 id="start-a-triple-store">Start a Triple Store</h2>
<p>A quick recap - a Triple Store is a type of graph database conforming to standards provided by the W3C, for storing RDF data. The standards proscribe various aspects of how the DB behaves, including how it responds to queries, formats result set and how it supports bulk data transport. I may dig into that in more detail in a later post.</p>
<p>To get up and running quickly, get yourself a copy of docker and docker-compose. Once you have done so, create a  <code>docker-compose.yaml</code> with this manifest. This installs Blazegraph DB. The technology in Blazegraph is rumoured to be the same technology behind AWS Neptune (since AWS is rumoured to have hire a bunch of engineers from the company behind Blazegraph).</p>
<pre tabindex="0"><code>version: '3.7'
services:
    blazegraph:
        image: metaphacts/blazegraph-basic:2.2.0-20160908.003514-6
        hostname: blazegraph
        container_name: blazegraph
        ports:
            - &quot;8889:8080&quot;
            - &quot;8890:80&quot;
</code></pre><p>To run the triple store, in-memory, invoke docker-compose like so:</p>
<pre tabindex="0"><code>$&gt; docker-compose up -d

Creating network &quot;blog_default&quot; with the default driver
Creating blazegraph ... done
</code></pre><p>Let&rsquo;s hit the store with a query. I don&rsquo;t expect to get anything back yet, but I do expect not to get any errors:</p>
<pre tabindex="0"><code>rsparql --service='http://localhost:8889/blazegraph/namespace/kb/sparql/update' --query=./soccer/queries/get_teams.rq

--------
| team |
========
--------
</code></pre><p>Fine. it&rsquo;s up and running. Now create a turtle file called  <code>add_teams.rq </code>.</p>
<pre tabindex="0"><code>PREFIX s: &lt;http://tempuri.com/soccer/&gt;
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;

INSERT DATA {
    s:ArsenalFC a s:Team;
        s:homeCity s:London;
        rdfs:label &quot;Arsenal F.C.&quot; .

    s:ChelseaFC a s:Team;
        s:homeCity s:London;
        rdfs:label &quot;Chelsea F.C.&quot; .

    s:LiverpoolFC a s:Team;
        s:homeCity s:Liverpool;
        rdfs:label &quot;Liverpool F.C.&quot; .
}
</code></pre><p>This we will use to push some data into the store. We use another tool from the Jena tool set, called  <code>rupdate </code>, which allows the use of the <a href="https://www.w3.org/TR/sparql11-update/">SPARQL Update</a> class of operations - in other words, it allows us to insert, update and delete RDF in our triple store.</p>
<pre tabindex="0"><code>rupdate --service='http://localhost:8889/blazegraph/namespace/kb/sparql/update' --update=./add_teams.rq
</code></pre><p>Now when we re-present our query earlier, it should give us something interesting back.</p>
<pre tabindex="0"><code>rsparql --service='http://localhost:8889/blazegraph/namespace/kb/sparql/update' --query=./get_teams.rq

----------------
| team         |
================
| :ArsenalFC   |
| :ChelseaFC   |
| :LiverpoolFC |
----------------
</code></pre><p>Great. Now we have data going to and from our triple store, let&rsquo;s expand our graph with some other interesting data. Put this in a file  <code>add_players.rq</code> and send it to Blazegraph the same as before.</p>
<pre tabindex="0"><code>PREFIX s: &lt;http://tempuri.com/soccer/&gt;
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
PREFIX foaf: &lt;http://xmlns.com/foaf/0.1/&gt;

INSERT DATA {
    s:BerndLeno a s:Footballer;
        foaf:givenName &quot;Bernd&quot;;
        foaf:familyName &quot;Leno&quot;.

    s:HectorBellerin a s:Footballer;
        foaf:givenName &quot;Hector&quot;;
        foaf:familyName &quot;Bellerin&quot;.

    s:KieranTierney a s:Footballer;
        foaf:givenName &quot;Kieran&quot;;
        foaf:familyName &quot;Tierney&quot;.

    s:KepaArrizabalaga a s:Footballer;
        foaf:givenName &quot;Kepa&quot;;
        foaf:familyName &quot;Arrizabalaga&quot;.

    s:AntonioRudiger a s:Footballer;
        foaf:givenName &quot;Antonio&quot;;
        foaf:familyName &quot;Rudiger&quot;.

    s:MarcosAlonso a s:Footballer;
        foaf:givenName &quot;Marcos&quot;;
        foaf:familyName &quot;Alonso&quot;.

    s:Alisson a s:Footballer;
        foaf:givenName &quot;Alisson&quot;.

    s:NathanielClyne a s:Footballer;
        foaf:givenName &quot;Nathaniel&quot;;
        foaf:familyName &quot;Clyne&quot;.

    s:Fabinho a s:Footballer;
        foaf:givenName &quot;Fabinho&quot;.
}
</code></pre><p>We should now be able to pull back the player data. Again, create an  <code>rq</code> file and send it to Blazegraph using  <code>rsparql </code>.</p>
<pre tabindex="0"><code>PREFIX s: &lt;http://tempuri.com/soccer/&gt;

SELECT ?player
WHERE {
    ?player a s:Footballer .
}
LIMIT 10
</code></pre><pre tabindex="0"><code>rsparql --service='http://localhost:8889/blazegraph/namespace/kb/sparql' --query=./queries/get_players.rq

----------------------
| player             |
======================
| s:Alisson          |
| s:AntonioRudiger   |
| s:BerndLeno        |
| s:Fabinho          |
| s:HectorBellerin   |
| s:KepaArrizabalaga |
| s:KieranTierney    |
| s:MarcosAlonso     |
| s:NathanielClyne   |
----------------------
</code></pre><h3 id="beware-of-non-unicode-tooling">Beware of non-unicode tooling</h3>
<p>All of the RDF standards are designed to be Unicode aware from the bottom up. When using Jena, though, you may find it doesn&rsquo;t understand Unicode. I initially wrote some RDF with accented characters.</p>
<pre tabindex="0"><code>    s:AntonioRüdiger a s:Footballer;
        foaf:givenName &quot;Antonio&quot;;
        foaf:familyName &quot;Rüdiger&quot;.
</code></pre><p>When I tried to update the triple store I got the following, not very useful, error message.</p>
<pre tabindex="0"><code>rupdate --service='http://localhost:8889/blazegraph/namespace/kb/sparql/update' --update=./queries/02.add-players.rq
org.apache.jena.atlas.web.HttpException: 400 - Bad Request
        at org.apache.jena.riot.web.HttpOp.exec(HttpOp.java:1093)
        at org.apache.jena.riot.web.HttpOp.execHttpPost(HttpOp.java:721)
        at org.apache.jena.riot.web.HttpOp.execHttpPost(HttpOp.java:517)
        at org.apache.jena.riot.web.HttpOp.execHttpPost(HttpOp.java:473)
        at org.apache.jena.sparql.modify.UpdateProcessRemote.execute(UpdateProcessRemote.java:81)
        at arq.rupdate.exec(rupdate.java:94)
        at arq.rupdate.exec(rupdate.java:80)
        at jena.cmd.CmdMain.mainMethod(CmdMain.java:93)
        at jena.cmd.CmdMain.mainRun(CmdMain.java:58)
        at jena.cmd.CmdMain.mainRun(CmdMain.java:45)
        at arq.rupdate.main(rupdate.java:44)
</code></pre><h3 id="gui-experiences">GUI Experiences</h3>
<p>I personally enjoy working on the CLI, but you might be more visual then me. Blazegraph provides a web based UI for you to query and update. It&rsquo;s helpful if you need to quickly explore to find out what kind of data it contains.</p>
<p><img src="https://aabs.files.wordpress.com/2019/09/image-1.png?w=955" alt="A simple UI comes out of the box with Blazegraph">{.wp-image-7382}</p>
<h3 id="querying-a-more-complex-graph">Querying a more complex graph</h3>
<p>Now let&rsquo;s link up the teams and players using contracts, so that we can show how a knowledge graph allows us to query through complex relationships.</p>
<pre tabindex="0"><code>PREFIX s: &lt;http://tempuri.com/soccer/&gt;
PREFIX xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt;

INSERT DATA
{

    [] a s:PlayerContract; s:withTeam s:ArsenalFC; s:withPlayer s:BerndLeno;
        s:from &quot;2019-01-01&quot;^^xsd:date; s:to &quot;2020-01-01&quot;^^xsd:date.
    [] a s:PlayerContract; s:withTeam s:ArsenalFC; s:withPlayer s:HectorBellerin;
        s:from &quot;2019-01-01&quot;^^xsd:date; s:to &quot;2020-01-01&quot;^^xsd:date.
    [] a s:PlayerContract; s:withTeam s:ArsenalFC; s:withPlayer s:KieranTierney;
        s:from &quot;2019-01-01&quot;^^xsd:date; s:to &quot;2020-01-01&quot;^^xsd:date.

    [] a s:PlayerContract; s:withTeam s:ChelseaFC; s:withPlayer s:KepaArrizabalaga;
        s:from &quot;2019-01-01&quot;^^xsd:date; s:to &quot;2020-01-01&quot;^^xsd:date.
    [] a s:PlayerContract; s:withTeam s:ChelseaFC; s:withPlayer s:AntonioRudiger;
        s:from &quot;2019-01-01&quot;^^xsd:date; s:to &quot;2020-01-01&quot;^^xsd:date.
    [] a s:PlayerContract; s:withTeam s:ChelseaFC; s:withPlayer s:MarcosAlonso;
        s:from &quot;2019-01-01&quot;^^xsd:date; s:to &quot;2020-01-01&quot;^^xsd:date.

    [] a s:PlayerContract; s:withTeam s:LiverpoolFC; s:withPlayer s:Alisson;
        s:from &quot;2019-01-01&quot;^^xsd:date; s:to &quot;2020-01-01&quot;^^xsd:date.
    [] a s:PlayerContract; s:withTeam s:LiverpoolFC; s:withPlayer s:NathanielClyne;
        s:from &quot;2019-01-01&quot;^^xsd:date; s:to &quot;2020-01-01&quot;^^xsd:date.
    [] a s:PlayerContract; s:withTeam s:LiverpoolFC; s:withPlayer s:Fabinho;
        s:from &quot;2019-01-01&quot;^^xsd:date; s:to &quot;2020-01-01&quot;^^xsd:date.
}
</code></pre><p>This contract data links the team with the player, allowing us to ask some more interesting questions. Let&rsquo;s start off by finding all the players who play for Arsenal.</p>
<pre tabindex="0"><code>PREFIX s: &lt;http://tempuri.com/soccer/&gt;

SELECT ?player
WHERE {
    ?player a s:Footballer .
    [] a s:PlayerContract;
        s:withTeam s:ArsenalFC;
        s:withPlayer ?player .
}
LIMIT 10
</code></pre><p>This is pretty straightforward, requiring little traversal of the graph.</p>
<pre tabindex="0"><code>rsparql --service='http://localhost:8889/blazegraph/namespace/kb/sparql' --query=./queries/arsenal_players.rq

--------------------
| player           |
====================
| s:BerndLeno      |
| s:HectorBellerin |
| s:KieranTierney  |
--------------------
</code></pre><p>Let&rsquo;s see if we can find a list of all the players in London? In fact we don&rsquo;t care about the URL of the player, just their first and last name.</p>
<pre tabindex="0"><code>PREFIX s: &lt;http://tempuri.com/soccer/&gt;
PREFIX foaf: &lt;http://xmlns.com/foaf/0.1/&gt;

SELECT ?givenName ?familyName
WHERE {
    ?player a s:Footballer ;
        foaf:givenName ?givenName;
        foaf:familyName ?familyName .
    ?team a s:Team;
        s:homeCity s:London .
    _:contract a s:PlayerContract;
        s:withTeam ?team;
        s:withPlayer ?player .
}
LIMIT 10
</code></pre><p>Remember from last time, how I mentioned that the way to think of query writing in SPARQL is to show what structures from the graph you want, providing what you know and leaving blanks (in the form of variables) for what you don&rsquo;t.</p>
<p>In the query above, the only concrete thing I provide is that the team home city must be London. From there it navigates the graph to find what matches.  <code>London - team - contract - player - givenName </code></p>
<p>The queries are now starting to look a bit less trivial.</p>
<pre tabindex="0"><code>rsparql --service='http://localhost:8889/blazegraph/namespace/kb/sparql' --query=./queries/london_players.rq

------------------------------
| givenName | familyName     |
==============================
| &quot;Antonio&quot; | &quot;Rudiger&quot;      |
| &quot;Bernd&quot;   | &quot;Leno&quot;         |
| &quot;Hector&quot;  | &quot;Bellerin&quot;     |
| &quot;Kepa&quot;    | &quot;Arrizabalaga&quot; |
| &quot;Kieran&quot;  | &quot;Tierney&quot;      |
| &quot;Marcos&quot;  | &quot;Alonso&quot;       |
------------------------------
</code></pre><p>Needless to say, it wouldn&rsquo;t be that much more difficult to link in more info about the national side these players play for. We could then ask fruity questions like &ldquo;<em>Get me the personal details of danish footballers playing for a london based club</em>&rdquo;.</p>
<h2 id="summary">Summary</h2>
<p>I&rsquo;ve shown in this installment how to fire up a proper triple store using Docker and insert and retrieve data from it using the CLI tools. I showed how you can incrementally build up your data, and then use SPARQL to query through complex relationships with ease.</p>
<p>Next time I will do this with Amazon Neptune, which won&rsquo;t be that much different in terms of SPARQL, so I will hook up some C# code to do it for me.</p>
<ul class="pa0">
  
</ul>
<div class="mt6 instapaper_ignoref">
      
      
      </div>
    </div>

    <aside class="w-30-l mt6-l">




</aside>

  </article>

    </main>
    <footer class="bg-black bottom-0 w-100 pa3" role="contentinfo">
  <div class="flex justify-between">
  <a class="f4 fw4 hover-white no-underline white-70 dn dib-ns pv2 ph3" href="http://45.89.107.9/" >
    &copy;  The Wandering Glitch 2022 
  </a>
    <div>
<div class="ananke-socials">
  
</div>
</div>
  </div>
</footer>

  </body>
</html>
