<!DOCTYPE html>
<html lang="en">
  <head>
    <title>
  Knowledge Graphs 2 - Playing on the CLI · The Wandering Glitch
</title>
    <meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="color-scheme" content="light dark">




<meta name="description" content="Last time I showed how to write RDF in Turtle, and how to make very simple queries in SPARQL. What I didn&rsquo;t show was how to get your hands dirty. Specifically, I want to show you how to try things out on the cheap command line. I will show examples of how to build out your RDF data to more depth using Turtle files, and how to use the Jena framework to create queries against that data, so you can work out ahead of time how to navigate your graph of data.">
<meta name="keywords" content="">

<meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="Knowledge Graphs 2 - Playing on the CLI"/>
<meta name="twitter:description" content="Last time I showed how to write RDF in Turtle, and how to make very simple queries in SPARQL. What I didn&rsquo;t show was how to get your hands dirty. Specifically, I want to show you how to try things out on the cheap command line. I will show examples of how to build out your RDF data to more depth using Turtle files, and how to use the Jena framework to create queries against that data, so you can work out ahead of time how to navigate your graph of data."/>

<meta property="og:title" content="Knowledge Graphs 2 - Playing on the CLI" />
<meta property="og:description" content="Last time I showed how to write RDF in Turtle, and how to make very simple queries in SPARQL. What I didn&rsquo;t show was how to get your hands dirty. Specifically, I want to show you how to try things out on the cheap command line. I will show examples of how to build out your RDF data to more depth using Turtle files, and how to use the Jena framework to create queries against that data, so you can work out ahead of time how to navigate your graph of data." />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://industrialinference.com/2019/09/knowledge-graphs-2-playing-on-the-cli/" /><meta property="article:section" content="posts" />
<meta property="article:published_time" content="2019-09-13T00:00:00+00:00" />
<meta property="article:modified_time" content="2019-09-13T00:00:00+00:00" />




<link rel="canonical" href="https://industrialinference.com/2019/09/knowledge-graphs-2-playing-on-the-cli/">


<link rel="preload" href="/fonts/forkawesome-webfont.woff2?v=1.2.0" as="font" type="font/woff2" crossorigin>


  
  
  <link rel="stylesheet" href="/css/coder.min.7f9d180e3b3bebba9ba80d55eed1255c35e00764872854736d6ad7db38884ffc.css" integrity="sha256-f50YDjs767qbqA1V7tElXDXgB2SHKFRzbWrX2ziIT/w=" crossorigin="anonymous" media="screen" />








 




<link rel="icon" type="image/png" href="/images/favicon-32x32.png" sizes="32x32">
<link rel="icon" type="image/png" href="/images/favicon-16x16.png" sizes="16x16">

<link rel="apple-touch-icon" href="/images/apple-touch-icon.png">
<link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon.png">

<link rel="manifest" href="/site.webmanifest">
<link rel="mask-icon" href="/images/safari-pinned-tab.svg" color="#5bbad5">




<meta name="generator" content="Hugo 0.108.0">





  </head>




<body class="preload-transitions colorscheme-light">
  
<div class="float-container">
    <a id="dark-mode-toggle" class="colorscheme-toggle">
        <i class="fa fa-adjust fa-fw" aria-hidden="true"></i>
    </a>
</div>


  <main class="wrapper">
    <nav class="navigation">
  <section class="container">
    <a class="navigation-title" href="/">
      The Wandering Glitch
    </a>
    
  </section>
</nav>


    <div class="content">
      
  <section class="container post">
    <article>
      <header>
        <div class="post-title">
          <h1 class="title">
            <a class="title-link" href="https://industrialinference.com/2019/09/knowledge-graphs-2-playing-on-the-cli/">
              Knowledge Graphs 2 - Playing on the CLI
            </a>
          </h1>
        </div>
        <div class="post-meta">
          <div class="date">
            <span class="posted-on">
              <i class="fa fa-calendar" aria-hidden="true"></i>
              <time datetime="2019-09-13T00:00:00Z">
                September 13, 2019
              </time>
            </span>
            <span class="reading-time">
              <i class="fa fa-clock-o" aria-hidden="true"></i>
              4-minute read
            </span>
          </div>
          
          
          
        </div>
      </header>

      <div>
        
        <p>Last time I showed how to write RDF in Turtle, and how to make very simple queries in SPARQL. What I didn&rsquo;t show was how to get your hands dirty. Specifically, I want to show you how to try things out on the <del>cheap</del> command line. I will show examples of how to build out your RDF data to more depth using Turtle files, and how to use the Jena framework to create queries against that data, so you can work out ahead of time how to navigate your graph of data.</p>
<ul>
<li><a href="https://andrewmatthews.blog/2019/09/12/knowledge-graphs-101/">Knowledge Graphs 101</a></li>
<li><a href="https://andrewmatthews.blog/2019/09/13/knowledge-graphs-2-playing-on-the-cli/">Knowledge Graphs 2 – Playing on the CLI</a></li>
<li><a href="https://andrewmatthews.blog/2019/09/13/knowledge-graphs-3-using-a-triple-store/">Knowledge Graphs 3 – Using a Triple Store</a></li>
<li><a href="https://andrewmatthews.blog/2019/09/16/knowledge-graphs-4-querying-your-knowledge-graph-using-net/">Knowledge Graphs 4 – Querying your knowledge graph using .NET</a></li>
<li><a href="https://andrewmatthews.blog/2019/10/03/knowledge-graphs-5-modelling-with-rdfs/">Knowledge Graphs 5 – Modelling with RDFS</a></li>
<li><a href="https://andrewmatthews.blog/2019/10/03/knowledge-graphs-6-semantics/">Knowledge Graphs 6 - Semantics</a></li>
<li><a href="https://aabs.wordpress.com/2019/11/06/knowledge-graphs-7-named-graphs/">Knowledge Graphs 7 - Named graphs</a></li>
</ul>
<h2 id="step-1---get-some-local-tools">
  Step 1 - Get some local tools
  <a class="heading-link" href="#step-1---get-some-local-tools">
    <i class="fa fa-link" aria-hidden="true" title="Link to heading"></i>
    <span class="sr-only">Link to heading</span>
  </a>
</h2>
<p>Assuming you are running on Linux, or have WSL installed on windows, you can easily get up and running using the Apache Jena toolkit.</p>
<p>To install Jena on Ubuntu/MacOS using LinuxBrew or HomeBrew.</p>
<pre tabindex="0"><code>$&gt; brew install jena
</code></pre><p>To test it is installed, check it like so:</p>
<pre tabindex="0"><code>$&gt; sparql -version
Jena:       VERSION: 3.12.0
Jena:       BUILD_DATE: 2019-05-27T16:07:27+0000
</code></pre><p>The <code>sparql</code>CLI tool is used to issue SPARQL queries against a local copy of the data. There is a corresponding tool called <code>rsparql</code>that allows you to query using the SPARQL Protocol with a remote W3C compliant triple store.</p>
<p>That&rsquo;s all we need to get started. Let&rsquo;s create a knowledge graph! This knowledge graph will be in the sporting domain, and I will build on it in future posts.</p>
<h2 id="step-2---query-local-data">
  Step 2 - Query local data
  <a class="heading-link" href="#step-2---query-local-data">
    <i class="fa fa-link" aria-hidden="true" title="Link to heading"></i>
    <span class="sr-only">Link to heading</span>
  </a>
</h2>
<p>Create a file called <code>soccer.ttl</code>to contain your data. I use Visual Studio Code, since there are some nice syntax highlighting plugins for Turtle files, but any editor will do.</p>
<pre tabindex="0"><code>@prefix : &lt;http://tempuri.com/soccer/&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt; .
@prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix time: &lt;http://www.w3.org/2006/time#&gt;.
@prefix foaf: &lt;http://xmlns.com/foaf/0.1/&gt; .

:ArsenalFC a :Team;
    :homeCity :London;
    rdfs:label &#34;Arsenal F.C.&#34; .

:LiverpoolFC a :Team;
    :homeCity :Liverpool;
    rdfs:label &#34;Liverpool F.C.&#34; .

:PremierLeague a :FootballLeague;
    :hasMember :ArsenalFC, :LiverpoolFC .

:BerndLeno a :Footballer;
    foaf:givenName &#34;Bernd&#34;;
    foaf:familyName &#34;Leno&#34;.
:HectorBellerin a :Footballer;
    foaf:givenName &#34;Héctor&#34;;
    foaf:familyName &#34;Bellerín&#34;.
:KieranTierney a :Footballer;
    foaf:givenName &#34;Kieran&#34;;
    foaf:familyName &#34;Tierney&#34;.

:KepaArrizabalaga a :Footballer;
    foaf:givenName &#34;Kepa&#34;;
    foaf:familyName &#34;Arrizabalaga&#34;.

:AntonioRüdiger a :Footballer;
    foaf:givenName &#34;Antonio&#34;;
    foaf:familyName &#34;Rüdiger&#34;.

:MarcosAlonso a :Footballer;
    foaf:givenName &#34;Marcos&#34;;
    foaf:familyName &#34;Alonso&#34;.


:Alisson a :Footballer;
    foaf:givenName &#34;Alisson&#34;.
:NathanielClyne a :Footballer;
    foaf:givenName &#34;Nathaniel&#34;;
    foaf:familyName &#34;Clyne&#34;.
:Fabinho a :Footballer;
    foaf:givenName &#34;Fabinho&#34;.

[] a :PlayerContract; :withTeam :ArsenalFC; :withPlayer :BerndLeno;
    :from &#34;2019-01-01&#34;^^xsd:date; :to &#34;2020-01-01&#34;^^xsd:date.
[] a :PlayerContract; :withTeam :ArsenalFC; :withPlayer :HectorBellerin;
    :from &#34;2019-01-01&#34;^^xsd:date; :to &#34;2020-01-01&#34;^^xsd:date.
[] a :PlayerContract; :withTeam :ArsenalFC; :withPlayer :KieranTierney;
    :from &#34;2019-01-01&#34;^^xsd:date; :to &#34;2020-01-01&#34;^^xsd:date.

[] a :PlayerContract; :withTeam :ChelseaFC; :withPlayer :KepaArrizabalaga;
    :from &#34;2019-01-01&#34;^^xsd:date; :to &#34;2020-01-01&#34;^^xsd:date.
[] a :PlayerContract; :withTeam :ChelseaFC; :withPlayer :AntonioRüdiger;
    :from &#34;2019-01-01&#34;^^xsd:date; :to &#34;2020-01-01&#34;^^xsd:date.
[] a :PlayerContract; :withTeam :ChelseaFC; :withPlayer :MarcosAlonso;
    :from &#34;2019-01-01&#34;^^xsd:date; :to &#34;2020-01-01&#34;^^xsd:date.

[] a :PlayerContract; :withTeam :LiverpoolFC; :withPlayer :Alisson;
    :from &#34;2019-01-01&#34;^^xsd:date; :to &#34;2020-01-01&#34;^^xsd:date.
[] a :PlayerContract; :withTeam :LiverpoolFC; :withPlayer :NathanielClyne;
    :from &#34;2019-01-01&#34;^^xsd:date; :to &#34;2020-01-01&#34;^^xsd:date.
[] a :PlayerContract; :withTeam :LiverpoolFC; :withPlayer :Fabinho;
    :from &#34;2019-01-01&#34;^^xsd:date; :to &#34;2020-01-01&#34;^^xsd:date.
</code></pre><p>Now let&rsquo;s write a simple SPARQL query, and store it in a query file (<code>*.rq</code>):</p>
<pre tabindex="0"><code>PREFIX : &lt;http://tempuri.com/soccer/&gt;

SELECT ?team
WHERE {
    ?team a :Team .
}
LIMIT 10
</code></pre><p>Use the <code>sparql</code>tool to make the query:</p>
<pre tabindex="0"><code>$&gt; sparql --data=soccer.ttl --query=get_teams.rq

----------------
| team         |
================
| :ArsenalFC   |
| :ChelseaFC   |
| :LiverpoolFC |
----------------
</code></pre><p>Perhaps we want to find only the London teams? See how easy it is to <em>declare what must be true</em>, rather than perform some filtration operation? Of course, SPARQL does have FILTER operations, but you can go a long way without resorting to it.</p>
<pre tabindex="0"><code>PREFIX : &lt;http://tempuri.com/soccer/&gt;

SELECT ?team
WHERE {
    ?team a :Team ;
        :homeCity :London .
}
LIMIT 10
</code></pre><p>The results are as you would expect:</p>
<pre tabindex="0"><code>sparql --data=soccer.ttl --query=london_teams.rq
--------------
| team       |
==============
| :ChelseaFC |
| :ArsenalFC |
--------------
</code></pre><h2 id="summary">
  Summary
  <a class="heading-link" href="#summary">
    <i class="fa fa-link" aria-hidden="true" title="Link to heading"></i>
    <span class="sr-only">Link to heading</span>
  </a>
</h2>
<p>In this installment, I showed how to build out your RDF data to more depth using Turtle files. I show how to use the Jena framework to create queries against that data, so you can work out ahead of time how to navigate the graph of data. In later installments I will show how to using dotNetRdf to query and update data into a remote triple store.</p>
<p>Please let me know if you have any questions or if any of the ideas are not clear. Also, let me know if there are aspects of knowledge graphs that you would like to hear more about.</p>

      </div>


      <footer>
        


        
        
        
      </footer>
    </article>

    
  </section>

    </div>

    <footer class="footer">
  <section class="container">
    ©
    
    2022
    
    ·
    
    Powered by <a href="https://gohugo.io/">Hugo</a> & <a href="https://github.com/luizdepra/hugo-coder/">Coder</a>.
    
  </section>
</footer>

  </main>

  

  
  
  <script src="/js/coder.min.27afce394fb6284f521b3fbc9f6a8326342333c3092267f3944d770489876fed.js" integrity="sha256-J6/OOU&#43;2KE9SGz&#43;8n2qDJjQjM8MJImfzlE13BImHb&#43;0="></script>
  

  

  

  

  

  

  

  

  

  
</body>

</html>
