<!DOCTYPE html>
<html lang="">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
  <title>Knowledge Graphs 2 - Playing on the CLI - The Wandering Glitch</title>
  <meta property="og:title" content="Knowledge Graphs 2 - Playing on the CLI - The Wandering Glitch" />
  <meta name="twitter:title" content="Knowledge Graphs 2 - Playing on the CLI - The Wandering Glitch" />
  <meta name="description" content="Last time I showed how to write RDF in Turtle, and how to make very simple queries in SPARQL. What I didn&rsquo;t show was how to get your hands dirty. Specifically, I want to show you how to try things out on the cheap command line. I will show examples of how to build out your RDF data to more depth using Turtle files, and how to use the Jena framework to create queries against that data, so you can work out ahead of time how to navigate your graph of data.">
  <meta property="og:description" content="Last time I showed how to write RDF in Turtle, and how to make very simple queries in SPARQL. What I didn&rsquo;t show was how to get your hands dirty. Specifically, I want to show you how to try things out on the cheap command line. I will show examples of how to build out your RDF data to more depth using Turtle files, and how to use the Jena framework to create queries against that data, so you can work out ahead of time how to navigate your graph of data.">
  <meta name="twitter:description" content="Last time I showed how to write RDF in Turtle, and how to make very simple queries in SPARQL. What I didn&rsquo;t show was how to get your hands dirty. Specifically, I want to show you how to try …">
  <meta name="author" content="Andrew Matthews"/>
  <meta property="og:site_name" content="The Wandering Glitch" />
  <meta property="og:url" content="https://industrialinference.com/2019/09/knowledge-graphs-2-playing-on-the-cli/" />
  <meta property="og:type" content="article" />
  <meta name="twitter:card" content="summary" />
  <meta name="generator" content="Hugo 0.92.2" />

  <link rel="stylesheet" href="/css/style.css" media="all" />
  <link rel="stylesheet" href="/css/syntax.css" media="all" />
  <link rel="stylesheet" href="/css/custom.css" media="all" />

  <script src="/js/script.js"></script>
  <script src="/js/custom.js"></script>
  <script defer src="/js/fontawesome.js"></script>
</head>

<body>

<header class="site-header">
  <nav class="site-navi">
    <h1 class="site-title"><a href="/">The Wandering Glitch</a></h1>
    <ul class="site-navi-items">
      <li class="site-navi-item-series"><a href="/series/" title="Series">Series</a></li>
      <li class="site-navi-item-tags"><a href="/tags/" title="Tags">Tags</a></li>
      <li class="site-navi-item-archives"><a href="/archives/" title="Archives">Archives</a></li>
      <li class="site-navi-item-about"><a href="/about/" title="About">About</a></li>
    </ul>
  </nav>
</header>
<hr class="site-header-bottom">

  <div class="main" role="main">
    <article class="article">
      
      <p class="article-title-series"><a href="/series/working-with-knowledge-graphs/">Working with Knowledge Graphs</a>&nbsp;/</p>
      <h1 class="article-title">Knowledge Graphs 2 - Playing on the CLI</h1>
      
      <hr class="article-title-bottom">
      <ul class="article-meta">
        <li class="article-meta-date"><time>September 12, 2019</time></li>
        <li class="article-meta-tags">
          <a href="/tags/rdf/">
            <i class="fas fa-tag"></i>
            rdf
          </a>&nbsp;
        </li>
        <li class="article-meta-tags">
          <a href="/tags/knowledge-graphs/">
            <i class="fas fa-tag"></i>
            knowledge graphs
          </a>&nbsp;
        </li>
        <li class="article-meta-tags">
          <a href="/tags/sparql/">
            <i class="fas fa-tag"></i>
            sparql
          </a>&nbsp;
        </li>
      </ul>
      
<aside class="toc">
  <nav id="TableOfContents">
  <ul>
    <li><a href="#step-1---get-some-local-tools">Step 1 - Get some local tools</a></li>
    <li><a href="#step-2---query-local-data">Step 2 - Query local data</a></li>
    <li><a href="#summary">Summary</a></li>
  </ul>
</nav>
</aside>
      <p>Last time I showed how to write RDF in Turtle, and how to make very simple queries in SPARQL. What I didn&rsquo;t show was how to get your hands dirty. Specifically, I want to show you how to try things out on the <del>cheap</del> command line. I will show examples of how to build out your RDF data to more depth using Turtle files, and how to use the Jena framework to create queries against that data, so you can work out ahead of time how to navigate your graph of data.</p>
<ul>
<li><a href="https://andrewmatthews.blog/2019/09/12/knowledge-graphs-101/">Knowledge Graphs 101</a></li>
<li><a href="https://andrewmatthews.blog/2019/09/13/knowledge-graphs-2-playing-on-the-cli/">Knowledge Graphs 2 – Playing on the CLI</a></li>
<li><a href="https://andrewmatthews.blog/2019/09/13/knowledge-graphs-3-using-a-triple-store/">Knowledge Graphs 3 – Using a Triple Store</a></li>
<li><a href="https://andrewmatthews.blog/2019/09/16/knowledge-graphs-4-querying-your-knowledge-graph-using-net/">Knowledge Graphs 4 – Querying your knowledge graph using .NET</a></li>
<li><a href="https://andrewmatthews.blog/2019/10/03/knowledge-graphs-5-modelling-with-rdfs/">Knowledge Graphs 5 – Modelling with RDFS</a></li>
<li><a href="https://andrewmatthews.blog/2019/10/03/knowledge-graphs-6-semantics/">Knowledge Graphs 6 - Semantics</a></li>
<li><a href="https://aabs.wordpress.com/2019/11/06/knowledge-graphs-7-named-graphs/">Knowledge Graphs 7 - Named graphs</a></li>
</ul>
<h2 id="step-1---get-some-local-tools">Step 1 - Get some local tools</h2>
<p>Assuming you are running on Linux, or have WSL installed on windows, you can easily get up and running using the Apache Jena toolkit.</p>
<p>To install Jena on Ubuntu/MacOS using LinuxBrew or HomeBrew.</p>
<pre tabindex="0"><code>$&gt; brew install jena
</code></pre><p>To test it is installed, check it like so:</p>
<pre tabindex="0"><code>$&gt; sparql -version
Jena:       VERSION: 3.12.0
Jena:       BUILD_DATE: 2019-05-27T16:07:27+0000
</code></pre><p>The <code>sparql</code>CLI tool is used to issue SPARQL queries against a local copy of the data. There is a corresponding tool called <code>rsparql</code>that allows you to query using the SPARQL Protocol with a remote W3C compliant triple store.</p>
<p>That&rsquo;s all we need to get started. Let&rsquo;s create a knowledge graph! This knowledge graph will be in the sporting domain, and I will build on it in future posts.</p>
<h2 id="step-2---query-local-data">Step 2 - Query local data</h2>
<p>Create a file called <code>soccer.ttl</code>to contain your data. I use Visual Studio Code, since there are some nice syntax highlighting plugins for Turtle files, but any editor will do.</p>
<pre tabindex="0"><code>@prefix : &lt;http://tempuri.com/soccer/&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt; .
@prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix time: &lt;http://www.w3.org/2006/time#&gt;.
@prefix foaf: &lt;http://xmlns.com/foaf/0.1/&gt; .

:ArsenalFC a :Team;
    :homeCity :London;
    rdfs:label &quot;Arsenal F.C.&quot; .

:LiverpoolFC a :Team;
    :homeCity :Liverpool;
    rdfs:label &quot;Liverpool F.C.&quot; .

:PremierLeague a :FootballLeague;
    :hasMember :ArsenalFC, :LiverpoolFC .

:BerndLeno a :Footballer;
    foaf:givenName &quot;Bernd&quot;;
    foaf:familyName &quot;Leno&quot;.
:HectorBellerin a :Footballer;
    foaf:givenName &quot;Héctor&quot;;
    foaf:familyName &quot;Bellerín&quot;.
:KieranTierney a :Footballer;
    foaf:givenName &quot;Kieran&quot;;
    foaf:familyName &quot;Tierney&quot;.

:KepaArrizabalaga a :Footballer;
    foaf:givenName &quot;Kepa&quot;;
    foaf:familyName &quot;Arrizabalaga&quot;.

:AntonioRüdiger a :Footballer;
    foaf:givenName &quot;Antonio&quot;;
    foaf:familyName &quot;Rüdiger&quot;.

:MarcosAlonso a :Footballer;
    foaf:givenName &quot;Marcos&quot;;
    foaf:familyName &quot;Alonso&quot;.


:Alisson a :Footballer;
    foaf:givenName &quot;Alisson&quot;.
:NathanielClyne a :Footballer;
    foaf:givenName &quot;Nathaniel&quot;;
    foaf:familyName &quot;Clyne&quot;.
:Fabinho a :Footballer;
    foaf:givenName &quot;Fabinho&quot;.

[] a :PlayerContract; :withTeam :ArsenalFC; :withPlayer :BerndLeno;
    :from &quot;2019-01-01&quot;^^xsd:date; :to &quot;2020-01-01&quot;^^xsd:date.
[] a :PlayerContract; :withTeam :ArsenalFC; :withPlayer :HectorBellerin;
    :from &quot;2019-01-01&quot;^^xsd:date; :to &quot;2020-01-01&quot;^^xsd:date.
[] a :PlayerContract; :withTeam :ArsenalFC; :withPlayer :KieranTierney;
    :from &quot;2019-01-01&quot;^^xsd:date; :to &quot;2020-01-01&quot;^^xsd:date.

[] a :PlayerContract; :withTeam :ChelseaFC; :withPlayer :KepaArrizabalaga;
    :from &quot;2019-01-01&quot;^^xsd:date; :to &quot;2020-01-01&quot;^^xsd:date.
[] a :PlayerContract; :withTeam :ChelseaFC; :withPlayer :AntonioRüdiger;
    :from &quot;2019-01-01&quot;^^xsd:date; :to &quot;2020-01-01&quot;^^xsd:date.
[] a :PlayerContract; :withTeam :ChelseaFC; :withPlayer :MarcosAlonso;
    :from &quot;2019-01-01&quot;^^xsd:date; :to &quot;2020-01-01&quot;^^xsd:date.

[] a :PlayerContract; :withTeam :LiverpoolFC; :withPlayer :Alisson;
    :from &quot;2019-01-01&quot;^^xsd:date; :to &quot;2020-01-01&quot;^^xsd:date.
[] a :PlayerContract; :withTeam :LiverpoolFC; :withPlayer :NathanielClyne;
    :from &quot;2019-01-01&quot;^^xsd:date; :to &quot;2020-01-01&quot;^^xsd:date.
[] a :PlayerContract; :withTeam :LiverpoolFC; :withPlayer :Fabinho;
    :from &quot;2019-01-01&quot;^^xsd:date; :to &quot;2020-01-01&quot;^^xsd:date.
</code></pre><p>Now let&rsquo;s write a simple SPARQL query, and store it in a query file (<code>*.rq</code>):</p>
<pre tabindex="0"><code>PREFIX : &lt;http://tempuri.com/soccer/&gt;

SELECT ?team
WHERE {
    ?team a :Team .
}
LIMIT 10
</code></pre><p>Use the <code>sparql</code>tool to make the query:</p>
<pre tabindex="0"><code>$&gt; sparql --data=soccer.ttl --query=get_teams.rq

----------------
| team         |
================
| :ArsenalFC   |
| :ChelseaFC   |
| :LiverpoolFC |
----------------
</code></pre><p>Perhaps we want to find only the London teams? See how easy it is to <em>declare what must be true</em>, rather than perform some filtration operation? Of course, SPARQL does have FILTER operations, but you can go a long way without resorting to it.</p>
<pre tabindex="0"><code>PREFIX : &lt;http://tempuri.com/soccer/&gt;

SELECT ?team
WHERE {
    ?team a :Team ;
        :homeCity :London .
}
LIMIT 10
</code></pre><p>The results are as you would expect:</p>
<pre tabindex="0"><code>sparql --data=soccer.ttl --query=london_teams.rq
--------------
| team       |
==============
| :ChelseaFC |
| :ArsenalFC |
--------------
</code></pre><h2 id="summary">Summary</h2>
<p>In this installment, I showed how to build out your RDF data to more depth using Turtle files. I show how to use the Jena framework to create queries against that data, so you can work out ahead of time how to navigate the graph of data. In later installments I will show how to using dotNetRdf to query and update data into a remote triple store.</p>
<p>Please let me know if you have any questions or if any of the ideas are not clear. Also, let me know if there are aspects of knowledge graphs that you would like to hear more about.</p>

    </article>
    <section class="article-series">
      <h2 class="series-title"><a href="/series/working-with-knowledge-graphs/"><i class="fas fa-book"></i>&nbsp;Working with Knowledge Graphs</a></h2>
      <ol reversed="reversed" class="series">
        <li><a href="/2019/11/knowledge-graphs-7-named-graphs/">Knowledge Graphs 7 - Named Graphs</a></li>
        <li><a href="/2019/10/knowledge-graphs-6-semantics/">Knowledge Graphs 6 - Semantics</a></li>
        <li><a href="/2019/10/knowledge-graphs-5-modelling-with-rdfs/">Knowledge Graphs 5 - Modelling with RDFS</a></li>
        <li><a href="/2019/09/knowledge-graphs-4-querying-your-knowledge-graph-using-.net/">Knowledge Graphs 4 - Querying your knowledge graph using .NET</a></li>
        <li><a href="/2019/09/knowledge-graphs-3-using-a-triple-store/">Knowledge Graphs 3 - Using a Triple Store</a></li>
        <li class="active">Knowledge Graphs 2 - Playing on the CLI</li>
        <li><a href="/2019/09/knowledge-graphs-101/">Knowledge Graphs 101</a></li>
      </ol>
    </section>

    
<ul class="article-share">
  <li>
    
    <a class="resp-sharing-button__link" href="https://facebook.com/sharer/sharer.php?u=https://industrialinference.com/2019/09/knowledge-graphs-2-playing-on-the-cli/" target="_blank" rel="noopener" aria-label="Facebook">
      <div class="resp-sharing-button resp-sharing-button--facebook resp-sharing-button--medium"><div aria-hidden="true" class="resp-sharing-button__icon resp-sharing-button__icon--solid">
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M18.77 7.46H14.5v-1.9c0-.9.6-1.1 1-1.1h3V.5h-4.33C10.24.5 9.5 3.44 9.5 5.32v2.15h-3v4h3v12h5v-12h3.85l.42-4z"/></svg></div>Facebook</div>
    </a>
  </li>
  <li>
    
    <a class="resp-sharing-button__link" href="https://twitter.com/intent/tweet/?text=Knowledge%20Graphs%202%20-%20Playing%20on%20the%20CLI%20-%20The%20Wandering%20Glitch&amp;url=https://industrialinference.com/2019/09/knowledge-graphs-2-playing-on-the-cli/" target="_blank" rel="noopener" aria-label="Twitter">
      <div class="resp-sharing-button resp-sharing-button--twitter resp-sharing-button--medium"><div aria-hidden="true" class="resp-sharing-button__icon resp-sharing-button__icon--solid">
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M23.44 4.83c-.8.37-1.5.38-2.22.02.93-.56.98-.96 1.32-2.02-.88.52-1.86.9-2.9 1.1-.82-.88-2-1.43-3.3-1.43-2.5 0-4.55 2.04-4.55 4.54 0 .36.03.7.1 1.04-3.77-.2-7.12-2-9.36-4.75-.4.67-.6 1.45-.6 2.3 0 1.56.8 2.95 2 3.77-.74-.03-1.44-.23-2.05-.57v.06c0 2.2 1.56 4.03 3.64 4.44-.67.2-1.37.2-2.06.08.58 1.8 2.26 3.12 4.25 3.16C5.78 18.1 3.37 18.74 1 18.46c2 1.3 4.4 2.04 6.97 2.04 8.35 0 12.92-6.92 12.92-12.93 0-.2 0-.4-.02-.6.9-.63 1.96-1.22 2.56-2.14z"/></svg></div>Twitter</div>
    </a>
  </li>
</ul>


    <ul class="pager article-pager">
      <li class="pager-newer">
          <a href="/2019/09/knowledge-graphs-3-using-a-triple-store/" data-toggle="tooltip" data-placement="top" title="Knowledge Graphs 3 - Using a Triple Store">&lt; Newer</a>
      </li>
      <li class="pager-older">
        <a href="/2019/09/knowledge-graphs-101/" data-toggle="tooltip" data-placement="top" title="Knowledge Graphs 101">Older &gt;</a>
      </li>
    </ul>
  </div>


<div class="site-footer">
  <div class="copyright">Andrew Matthews</div>
  <ul class="site-footer-items">
  </ul>
  <div class="powerdby">
    Powered by <a href="https://gohugo.io/">Hugo</a> and <a href="https://github.com/taikii/whiteplain">Whiteplain</a>
  </div>
</div>


</body>
</html>
