<!DOCTYPE html>
<html lang="en-au">
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
    
    <title>Knowledge Graphs 2 - Playing on the CLI | The Wandering Glitch</title>
    <meta name="viewport" content="width=device-width,minimum-scale=1">
    <meta name="description" content="Last time I showed how to write RDF in Turtle, and how to make very simple queries in SPARQL. What I didn&rsquo;t show was how to get your hands dirty. Specifically, I want to show you how to try things out on the cheap command line. I will show examples of how to build out your RDF data to more depth using Turtle files, and how to use the Jena framework to create queries against that data, so you can work out ahead of time how to navigate your graph of data.">
    <meta name="generator" content="Hugo 0.92.2" />
    
    
    
    
      <meta name="robots" content="noindex, nofollow">
    

    
<link rel="stylesheet" href="/ananke/css/main.min.css" >



    
    
    
      

    

    
    
    <meta property="og:title" content="Knowledge Graphs 2 - Playing on the CLI" />
<meta property="og:description" content="Last time I showed how to write RDF in Turtle, and how to make very simple queries in SPARQL. What I didn&rsquo;t show was how to get your hands dirty. Specifically, I want to show you how to try things out on the cheap command line. I will show examples of how to build out your RDF data to more depth using Turtle files, and how to use the Jena framework to create queries against that data, so you can work out ahead of time how to navigate your graph of data." />
<meta property="og:type" content="article" />
<meta property="og:url" content="http://45.89.107.9/posts/2019-09-13-knowledge-graphs-2-playing-on-the-cli/" /><meta property="article:section" content="posts" />
<meta property="article:published_time" content="2019-09-13T00:00:00+00:00" />
<meta property="article:modified_time" content="2019-09-13T00:00:00+00:00" />

<meta itemprop="name" content="Knowledge Graphs 2 - Playing on the CLI">
<meta itemprop="description" content="Last time I showed how to write RDF in Turtle, and how to make very simple queries in SPARQL. What I didn&rsquo;t show was how to get your hands dirty. Specifically, I want to show you how to try things out on the cheap command line. I will show examples of how to build out your RDF data to more depth using Turtle files, and how to use the Jena framework to create queries against that data, so you can work out ahead of time how to navigate your graph of data."><meta itemprop="datePublished" content="2019-09-13T00:00:00+00:00" />
<meta itemprop="dateModified" content="2019-09-13T00:00:00+00:00" />
<meta itemprop="wordCount" content="757">
<meta itemprop="keywords" content="" /><meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="Knowledge Graphs 2 - Playing on the CLI"/>
<meta name="twitter:description" content="Last time I showed how to write RDF in Turtle, and how to make very simple queries in SPARQL. What I didn&rsquo;t show was how to get your hands dirty. Specifically, I want to show you how to try things out on the cheap command line. I will show examples of how to build out your RDF data to more depth using Turtle files, and how to use the Jena framework to create queries against that data, so you can work out ahead of time how to navigate your graph of data."/>

	
  </head>

  <body class="ma0 avenir bg-near-white">

    
   
  

  <header>
    <div class="bg-black">
      <nav class="pv3 ph3 ph4-ns" role="navigation">
  <div class="flex-l justify-between items-center center">
    <a href="/" class="f3 fw2 hover-white no-underline white-90 dib">
      
        The Wandering Glitch
      
    </a>
    <div class="flex-l items-center">
      

      
        <ul class="pl0 mr3">
          
          <li class="list f5 f4-ns fw4 dib pr3">
            <a class="hover-white no-underline white-90" href="/posts/" title="Posts page">
              Posts
            </a>
          </li>
          
        </ul>
      
      
<div class="ananke-socials">
  
    
    <a href="https://techhub.social/@aabs" target="_blank" rel="me noopener" class="mastodon ananke-social-link link-transition stackoverflow link dib z-999 pt3 pt0-l mr1" title="Mastodon link" aria-label="follow on Mastodon——Opens in a new window">
      
        <span class="icon"><svg style="enable-background:new 0 0 230 230;" version="1.1" viewBox="0 0 230 230"  xml:space="preserve" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
<path d="M211.80683 139.0875c-3.1825 16.36625-28.4925 34.2775-57.5625 37.74875-15.16 1.80875-30.0825 3.47125-45.99875 2.74125-26.0275-1.1925-46.565-6.2125-46.565-6.2125 0 2.53375.15625 4.94625.46875 7.2025 3.38375 25.68625 25.47 27.225 46.3925 27.9425 21.115.7225 39.91625-5.20625 39.91625-5.20625l.86875 19.09s-14.77 7.93125-41.08125 9.39c-14.50875.7975-32.52375-.365-53.50625-5.91875C9.23183 213.82 1.40558 165.31125.20808 116.09125c-.36375-14.61375-.14-28.39375-.14-39.91875 0-50.33 32.97625-65.0825 32.97625-65.0825C49.67058 3.45375 78.20308.2425 107.86433 0h.72875c29.66125.2425 58.21125 3.45375 74.8375 11.09 0 0 32.97625 14.7525 32.97625 65.0825 0 0 .4125 37.13375-4.6 62.915" style="fill-rule:evenodd;clip-rule:evenodd;"/>
<path d="M65.68743 96.45938c0 9.01375-7.3075 16.32125-16.3225 16.32125-9.01375 0-16.32-7.3075-16.32-16.32125 0-9.01375 7.30625-16.3225 16.32-16.3225 9.015 0 16.3225 7.30875 16.3225 16.3225M124.52893 96.45938c0 9.01375-7.30875 16.32125-16.3225 16.32125-9.01375 0-16.32125-7.3075-16.32125-16.32125 0-9.01375 7.3075-16.3225 16.32125-16.3225 9.01375 0 16.3225 7.30875 16.3225 16.3225M183.36933 96.45938c0 9.01375-7.3075 16.32125-16.32125 16.32125-9.01375 0-16.32125-7.3075-16.32125-16.32125 0-9.01375 7.3075-16.3225 16.32125-16.3225 9.01375 0 16.32125 7.30875 16.32125 16.3225" fill="#fff"/>
</svg>
</span>
      
<span class="new-window"><svg  height="8px"  style="enable-background:new 0 0 1000 1000;" version="1.1" viewBox="0 0 1000 1000"  xml:space="preserve" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" >
<path d="M598 128h298v298h-86v-152l-418 418-60-60 418-418h-152v-86zM810 810v-298h86v298c0 46-40 86-86 86h-596c-48 0-86-40-86-86v-596c0-46 38-86 86-86h298v86h-298v596h596z" style="fill-rule:evenodd;clip-rule:evenodd;"/>
</svg>
</span></a>
  
</div>

    </div>
  </div>
</nav>

    </div>
  </header>



    <main class="pb7" role="main">
      
  
  <article class="flex-l flex-wrap justify-between mw8 center ph3">
    <header class="mt4 w-100">
      <aside class="instapaper_ignoref b helvetica tracked">
          
        POSTS
      </aside>
      










  <div id="sharing" class="mt3 ananke-socials">
    
  </div>


      <h1 class="f1 athelas mt3 mb1">Knowledge Graphs 2 - Playing on the CLI</h1>
      
      <p class="tracked">
        By <strong>Andrew Matthews</strong>
      </p>
      
      
      
      <time class="f6 mv4 dib tracked" datetime="2019-09-13T00:00:00Z">September 13, 2019</time>
      

      
      
    </header>
    <div class="nested-copy-line-height lh-copy serif f4 nested-links #000000 pr4-l w-two-thirds-l"><p>Last time I showed how to write RDF in Turtle, and how to make very simple queries in SPARQL. What I didn&rsquo;t show was how to get your hands dirty. Specifically, I want to show you how to try things out on the <del>cheap</del> command line. I will show examples of how to build out your RDF data to more depth using Turtle files, and how to use the Jena framework to create queries against that data, so you can work out ahead of time how to navigate your graph of data.</p>
<ul>
<li><a href="https://andrewmatthews.blog/2019/09/12/knowledge-graphs-101/">Knowledge Graphs 101</a></li>
<li><a href="https://andrewmatthews.blog/2019/09/13/knowledge-graphs-2-playing-on-the-cli/">Knowledge Graphs 2 – Playing on the CLI</a></li>
<li><a href="https://andrewmatthews.blog/2019/09/13/knowledge-graphs-3-using-a-triple-store/">Knowledge Graphs 3 – Using a Triple Store</a></li>
<li><a href="https://andrewmatthews.blog/2019/09/16/knowledge-graphs-4-querying-your-knowledge-graph-using-net/">Knowledge Graphs 4 – Querying your knowledge graph using .NET</a></li>
<li><a href="https://andrewmatthews.blog/2019/10/03/knowledge-graphs-5-modelling-with-rdfs/">Knowledge Graphs 5 – Modelling with RDFS</a></li>
<li><a href="https://andrewmatthews.blog/2019/10/03/knowledge-graphs-6-semantics/">Knowledge Graphs 6 - Semantics</a></li>
<li><a href="https://aabs.wordpress.com/2019/11/06/knowledge-graphs-7-named-graphs/">Knowledge Graphs 7 - Named graphs</a></li>
</ul>
<h2 id="step-1---get-some-local-tools">Step 1 - Get some local tools</h2>
<p>Assuming you are running on Linux, or have WSL installed on windows, you can easily get up and running using the Apache Jena toolkit.</p>
<p>To install Jena on Ubuntu/MacOS using LinuxBrew or HomeBrew.</p>
<pre tabindex="0"><code>$&gt; brew install jena
</code></pre><p>To test it is installed, check it like so:</p>
<pre tabindex="0"><code>$&gt; sparql -version
Jena:       VERSION: 3.12.0
Jena:       BUILD_DATE: 2019-05-27T16:07:27+0000
</code></pre><p>The <code>sparql</code>CLI tool is used to issue SPARQL queries against a local copy of the data. There is a corresponding tool called <code>rsparql</code>that allows you to query using the SPARQL Protocol with a remote W3C compliant triple store.</p>
<p>That&rsquo;s all we need to get started. Let&rsquo;s create a knowledge graph! This knowledge graph will be in the sporting domain, and I will build on it in future posts.</p>
<h2 id="step-2---query-local-data">Step 2 - Query local data</h2>
<p>Create a file called <code>soccer.ttl</code>to contain your data. I use Visual Studio Code, since there are some nice syntax highlighting plugins for Turtle files, but any editor will do.</p>
<pre tabindex="0"><code>@prefix : &lt;http://tempuri.com/soccer/&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt; .
@prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt; .
@prefix owl: &lt;http://www.w3.org/2002/07/owl#&gt; .
@prefix time: &lt;http://www.w3.org/2006/time#&gt;.
@prefix foaf: &lt;http://xmlns.com/foaf/0.1/&gt; .

:ArsenalFC a :Team;
    :homeCity :London;
    rdfs:label &quot;Arsenal F.C.&quot; .

:LiverpoolFC a :Team;
    :homeCity :Liverpool;
    rdfs:label &quot;Liverpool F.C.&quot; .

:PremierLeague a :FootballLeague;
    :hasMember :ArsenalFC, :LiverpoolFC .

:BerndLeno a :Footballer;
    foaf:givenName &quot;Bernd&quot;;
    foaf:familyName &quot;Leno&quot;.
:HectorBellerin a :Footballer;
    foaf:givenName &quot;Héctor&quot;;
    foaf:familyName &quot;Bellerín&quot;.
:KieranTierney a :Footballer;
    foaf:givenName &quot;Kieran&quot;;
    foaf:familyName &quot;Tierney&quot;.

:KepaArrizabalaga a :Footballer;
    foaf:givenName &quot;Kepa&quot;;
    foaf:familyName &quot;Arrizabalaga&quot;.

:AntonioRüdiger a :Footballer;
    foaf:givenName &quot;Antonio&quot;;
    foaf:familyName &quot;Rüdiger&quot;.

:MarcosAlonso a :Footballer;
    foaf:givenName &quot;Marcos&quot;;
    foaf:familyName &quot;Alonso&quot;.


:Alisson a :Footballer;
    foaf:givenName &quot;Alisson&quot;.
:NathanielClyne a :Footballer;
    foaf:givenName &quot;Nathaniel&quot;;
    foaf:familyName &quot;Clyne&quot;.
:Fabinho a :Footballer;
    foaf:givenName &quot;Fabinho&quot;.

[] a :PlayerContract; :withTeam :ArsenalFC; :withPlayer :BerndLeno;
    :from &quot;2019-01-01&quot;^^xsd:date; :to &quot;2020-01-01&quot;^^xsd:date.
[] a :PlayerContract; :withTeam :ArsenalFC; :withPlayer :HectorBellerin;
    :from &quot;2019-01-01&quot;^^xsd:date; :to &quot;2020-01-01&quot;^^xsd:date.
[] a :PlayerContract; :withTeam :ArsenalFC; :withPlayer :KieranTierney;
    :from &quot;2019-01-01&quot;^^xsd:date; :to &quot;2020-01-01&quot;^^xsd:date.

[] a :PlayerContract; :withTeam :ChelseaFC; :withPlayer :KepaArrizabalaga;
    :from &quot;2019-01-01&quot;^^xsd:date; :to &quot;2020-01-01&quot;^^xsd:date.
[] a :PlayerContract; :withTeam :ChelseaFC; :withPlayer :AntonioRüdiger;
    :from &quot;2019-01-01&quot;^^xsd:date; :to &quot;2020-01-01&quot;^^xsd:date.
[] a :PlayerContract; :withTeam :ChelseaFC; :withPlayer :MarcosAlonso;
    :from &quot;2019-01-01&quot;^^xsd:date; :to &quot;2020-01-01&quot;^^xsd:date.

[] a :PlayerContract; :withTeam :LiverpoolFC; :withPlayer :Alisson;
    :from &quot;2019-01-01&quot;^^xsd:date; :to &quot;2020-01-01&quot;^^xsd:date.
[] a :PlayerContract; :withTeam :LiverpoolFC; :withPlayer :NathanielClyne;
    :from &quot;2019-01-01&quot;^^xsd:date; :to &quot;2020-01-01&quot;^^xsd:date.
[] a :PlayerContract; :withTeam :LiverpoolFC; :withPlayer :Fabinho;
    :from &quot;2019-01-01&quot;^^xsd:date; :to &quot;2020-01-01&quot;^^xsd:date.
</code></pre><p>Now let&rsquo;s write a simple SPARQL query, and store it in a query file (<code>*.rq</code>):</p>
<pre tabindex="0"><code>PREFIX : &lt;http://tempuri.com/soccer/&gt;

SELECT ?team
WHERE {
    ?team a :Team .
}
LIMIT 10
</code></pre><p>Use the <code>sparql</code>tool to make the query:</p>
<pre tabindex="0"><code>$&gt; sparql --data=soccer.ttl --query=get_teams.rq

----------------
| team         |
================
| :ArsenalFC   |
| :ChelseaFC   |
| :LiverpoolFC |
----------------
</code></pre><p>Perhaps we want to find only the London teams? See how easy it is to <em>declare what must be true</em>, rather than perform some filtration operation? Of course, SPARQL does have FILTER operations, but you can go a long way without resorting to it.</p>
<pre tabindex="0"><code>PREFIX : &lt;http://tempuri.com/soccer/&gt;

SELECT ?team
WHERE {
    ?team a :Team ;
        :homeCity :London .
}
LIMIT 10
</code></pre><p>The results are as you would expect:</p>
<pre tabindex="0"><code>sparql --data=soccer.ttl --query=london_teams.rq
--------------
| team       |
==============
| :ChelseaFC |
| :ArsenalFC |
--------------
</code></pre><h2 id="summary">Summary</h2>
<p>In this installment, I showed how to build out your RDF data to more depth using Turtle files. I show how to use the Jena framework to create queries against that data, so you can work out ahead of time how to navigate the graph of data. In later installments I will show how to using dotNetRdf to query and update data into a remote triple store.</p>
<p>Please let me know if you have any questions or if any of the ideas are not clear. Also, let me know if there are aspects of knowledge graphs that you would like to hear more about.</p>
<ul class="pa0">
  
</ul>
<div class="mt6 instapaper_ignoref">
      
      
      </div>
    </div>

    <aside class="w-30-l mt6-l">




</aside>

  </article>

    </main>
    <footer class="bg-black bottom-0 w-100 pa3" role="contentinfo">
  <div class="flex justify-between">
  <a class="f4 fw4 hover-white no-underline white-70 dn dib-ns pv2 ph3" href="http://45.89.107.9/" >
    &copy;  The Wandering Glitch 2022 
  </a>
    <div>
<div class="ananke-socials">
  
    
    <a href="https://techhub.social/@aabs" target="_blank" rel="me noopener" class="mastodon ananke-social-link link-transition stackoverflow link dib z-999 pt3 pt0-l mr1" title="Mastodon link" aria-label="follow on Mastodon——Opens in a new window">
      
        <span class="icon"><svg style="enable-background:new 0 0 230 230;" version="1.1" viewBox="0 0 230 230"  xml:space="preserve" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
<path d="M211.80683 139.0875c-3.1825 16.36625-28.4925 34.2775-57.5625 37.74875-15.16 1.80875-30.0825 3.47125-45.99875 2.74125-26.0275-1.1925-46.565-6.2125-46.565-6.2125 0 2.53375.15625 4.94625.46875 7.2025 3.38375 25.68625 25.47 27.225 46.3925 27.9425 21.115.7225 39.91625-5.20625 39.91625-5.20625l.86875 19.09s-14.77 7.93125-41.08125 9.39c-14.50875.7975-32.52375-.365-53.50625-5.91875C9.23183 213.82 1.40558 165.31125.20808 116.09125c-.36375-14.61375-.14-28.39375-.14-39.91875 0-50.33 32.97625-65.0825 32.97625-65.0825C49.67058 3.45375 78.20308.2425 107.86433 0h.72875c29.66125.2425 58.21125 3.45375 74.8375 11.09 0 0 32.97625 14.7525 32.97625 65.0825 0 0 .4125 37.13375-4.6 62.915" style="fill-rule:evenodd;clip-rule:evenodd;"/>
<path d="M65.68743 96.45938c0 9.01375-7.3075 16.32125-16.3225 16.32125-9.01375 0-16.32-7.3075-16.32-16.32125 0-9.01375 7.30625-16.3225 16.32-16.3225 9.015 0 16.3225 7.30875 16.3225 16.3225M124.52893 96.45938c0 9.01375-7.30875 16.32125-16.3225 16.32125-9.01375 0-16.32125-7.3075-16.32125-16.32125 0-9.01375 7.3075-16.3225 16.32125-16.3225 9.01375 0 16.3225 7.30875 16.3225 16.3225M183.36933 96.45938c0 9.01375-7.3075 16.32125-16.32125 16.32125-9.01375 0-16.32125-7.3075-16.32125-16.32125 0-9.01375 7.3075-16.3225 16.32125-16.3225 9.01375 0 16.32125 7.30875 16.32125 16.3225" fill="#fff"/>
</svg>
</span>
      
<span class="new-window"><svg  height="8px"  style="enable-background:new 0 0 1000 1000;" version="1.1" viewBox="0 0 1000 1000"  xml:space="preserve" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" >
<path d="M598 128h298v298h-86v-152l-418 418-60-60 418-418h-152v-86zM810 810v-298h86v298c0 46-40 86-86 86h-596c-48 0-86-40-86-86v-596c0-46 38-86 86-86h298v86h-298v596h596z" style="fill-rule:evenodd;clip-rule:evenodd;"/>
</svg>
</span></a>
  
</div>
</div>
  </div>
</footer>

  </body>
</html>
