<!DOCTYPE html>
<html lang="">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
  <title>Knowledge Graphs 3 - Using a Triple Store - The Wandering Glitch</title>
  <meta property="og:title" content="Knowledge Graphs 3 - Using a Triple Store - The Wandering Glitch" />
  <meta name="twitter:title" content="Knowledge Graphs 3 - Using a Triple Store - The Wandering Glitch" />
  <meta name="description" content="Last time I showed you how to use CLI tools to build out your RDF data to more depth using Turtle files and how to query it using the Apache Jena CLI toolchain using SPARQL Query language. This time I&rsquo;ll show how to insert and retrieve data from a remote triple store. I&rsquo;ll continue using the CLI tools for now.
 Knowledge Graphs 101 Knowledge Graphs 2 – Playing on the CLI Knowledge Graphs 3 – Using a Triple Store Knowledge Graphs 4 – Querying your knowledge graph using .">
  <meta property="og:description" content="Last time I showed you how to use CLI tools to build out your RDF data to more depth using Turtle files and how to query it using the Apache Jena CLI toolchain using SPARQL Query language. This time I&rsquo;ll show how to insert and retrieve data from a remote triple store. I&rsquo;ll continue using the CLI tools for now.
 Knowledge Graphs 101 Knowledge Graphs 2 – Playing on the CLI Knowledge Graphs 3 – Using a Triple Store Knowledge Graphs 4 – Querying your knowledge graph using .">
  <meta name="twitter:description" content="Last time I showed you how to use CLI tools to build out your RDF data to more depth using Turtle files and how to query it using the Apache Jena CLI toolchain using SPARQL Query language. This time …">
  <meta name="author" content="Andrew Matthews"/>
  <meta property="og:site_name" content="The Wandering Glitch" />
  <meta property="og:url" content="https://industrialinference.com/2019/09/knowledge-graphs-3-using-a-triple-store/" />
  <meta property="og:type" content="article" />
  <meta name="twitter:card" content="summary" />
  <meta name="generator" content="Hugo 0.92.2" />

  <link rel="stylesheet" href="/css/style.css" media="all" />
  <link rel="stylesheet" href="/css/syntax.css" media="all" />
  <link rel="stylesheet" href="/css/custom.css" media="all" />

  <script src="/js/script.js"></script>
  <script src="/js/custom.js"></script>
  <script defer src="/js/fontawesome.js"></script>
</head>

<body>

<header class="site-header">
  <nav class="site-navi">
    <h1 class="site-title"><a href="/">The Wandering Glitch</a></h1>
    <ul class="site-navi-items">
      <li class="site-navi-item-categories"><a href="/categories/" title="Categories">Categories</a></li>
      <li class="site-navi-item-tags"><a href="/tags/" title="Tags">Tags</a></li>
      <li class="site-navi-item-archives"><a href="/archives/" title="Archives">Archives</a></li>
      <li class="site-navi-item-about"><a href="/about/" title="About">About</a></li>
    </ul>
  </nav>
</header>
<hr class="site-header-bottom">

  <div class="main" role="main">
    <article class="article">
      
      
      <h1 class="article-title">Knowledge Graphs 3 - Using a Triple Store</h1>
      
      <hr class="article-title-bottom">
      <ul class="article-meta">
        <li class="article-meta-date"><time>September 13, 2019</time></li>
        <li class="article-meta-tags">
          <a href="/tags/rdf/">
            <i class="fas fa-tag"></i>
            rdf
          </a>&nbsp;
        </li>
        <li class="article-meta-tags">
          <a href="/tags/blazegraph/">
            <i class="fas fa-tag"></i>
            blazegraph
          </a>&nbsp;
        </li>
        <li class="article-meta-tags">
          <a href="/tags/knowledge-graphs/">
            <i class="fas fa-tag"></i>
            knowledge graphs
          </a>&nbsp;
        </li>
        <li class="article-meta-tags">
          <a href="/tags/sparql/">
            <i class="fas fa-tag"></i>
            sparql
          </a>&nbsp;
        </li>
      </ul>
      
<aside class="toc">
  <nav id="TableOfContents">
  <ul>
    <li><a href="#start-a-triple-store">Start a Triple Store</a>
      <ul>
        <li><a href="#beware-of-non-unicode-tooling">Beware of non-unicode tooling</a></li>
        <li><a href="#gui-experiences">GUI Experiences</a></li>
        <li><a href="#querying-a-more-complex-graph">Querying a more complex graph</a></li>
      </ul>
    </li>
    <li><a href="#summary">Summary</a></li>
  </ul>
</nav>
</aside>
      <p><a href="https://andrewmatthews.blog/2019/09/13/knowledge-graphs-2-playing-on-the-cli/">Last time</a> I showed you how to use CLI tools to build out your RDF data to more depth using Turtle files and how to query it using the Apache Jena CLI toolchain using SPARQL Query language. This time I&rsquo;ll show how to insert and retrieve data from a remote triple store. I&rsquo;ll continue using the CLI tools for now.</p>
<ul>
<li><a href="https://andrewmatthews.blog/2019/09/12/knowledge-graphs-101/">Knowledge Graphs 101</a></li>
<li><a href="https://andrewmatthews.blog/2019/09/13/knowledge-graphs-2-playing-on-the-cli/">Knowledge Graphs 2 – Playing on the CLI</a></li>
<li><a href="https://andrewmatthews.blog/2019/09/13/knowledge-graphs-3-using-a-triple-store/">Knowledge Graphs 3 – Using a Triple Store</a></li>
<li><a href="https://andrewmatthews.blog/2019/09/16/knowledge-graphs-4-querying-your-knowledge-graph-using-net/">Knowledge Graphs 4 – Querying your knowledge graph using .NET</a></li>
<li><a href="https://andrewmatthews.blog/2019/10/03/knowledge-graphs-5-modelling-with-rdfs/">Knowledge Graphs 5 – Modelling with RDFS</a></li>
<li><a href="https://andrewmatthews.blog/2019/10/03/knowledge-graphs-6-semantics/">Knowledge Graphs 6 - Semantics</a></li>
<li><a href="https://aabs.wordpress.com/2019/11/06/knowledge-graphs-7-named-graphs/">Knowledge Graphs 7 - Named graphs</a></li>
</ul>
<h2 id="start-a-triple-store">Start a Triple Store</h2>
<p>A quick recap - a Triple Store is a type of graph database conforming to standards provided by the W3C, for storing RDF data. The standards proscribe various aspects of how the DB behaves, including how it responds to queries, formats result set and how it supports bulk data transport. I may dig into that in more detail in a later post.</p>
<p>To get up and running quickly, get yourself a copy of docker and docker-compose. Once you have done so, create a  <code>docker-compose.yaml</code> with this manifest. This installs Blazegraph DB. The technology in Blazegraph is rumoured to be the same technology behind AWS Neptune (since AWS is rumoured to have hire a bunch of engineers from the company behind Blazegraph).</p>
<pre tabindex="0"><code>version: '3.7'
services:
    blazegraph:
        image: metaphacts/blazegraph-basic:2.2.0-20160908.003514-6
        hostname: blazegraph
        container_name: blazegraph
        ports:
            - &quot;8889:8080&quot;
            - &quot;8890:80&quot;
</code></pre><p>To run the triple store, in-memory, invoke docker-compose like so:</p>
<pre tabindex="0"><code>$&gt; docker-compose up -d

Creating network &quot;blog_default&quot; with the default driver
Creating blazegraph ... done
</code></pre><p>Let&rsquo;s hit the store with a query. I don&rsquo;t expect to get anything back yet, but I do expect not to get any errors:</p>
<pre tabindex="0"><code>rsparql --service='http://localhost:8889/blazegraph/namespace/kb/sparql/update' --query=./soccer/queries/get_teams.rq

--------
| team |
========
--------
</code></pre><p>Fine. it&rsquo;s up and running. Now create a turtle file called  <code>add_teams.rq </code>.</p>
<pre tabindex="0"><code>PREFIX s: &lt;http://tempuri.com/soccer/&gt;
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;

INSERT DATA {
    s:ArsenalFC a s:Team;
        s:homeCity s:London;
        rdfs:label &quot;Arsenal F.C.&quot; .

    s:ChelseaFC a s:Team;
        s:homeCity s:London;
        rdfs:label &quot;Chelsea F.C.&quot; .

    s:LiverpoolFC a s:Team;
        s:homeCity s:Liverpool;
        rdfs:label &quot;Liverpool F.C.&quot; .
}
</code></pre><p>This we will use to push some data into the store. We use another tool from the Jena tool set, called  <code>rupdate </code>, which allows the use of the <a href="https://www.w3.org/TR/sparql11-update/">SPARQL Update</a> class of operations - in other words, it allows us to insert, update and delete RDF in our triple store.</p>
<pre tabindex="0"><code>rupdate --service='http://localhost:8889/blazegraph/namespace/kb/sparql/update' --update=./add_teams.rq
</code></pre><p>Now when we re-present our query earlier, it should give us something interesting back.</p>
<pre tabindex="0"><code>rsparql --service='http://localhost:8889/blazegraph/namespace/kb/sparql/update' --query=./get_teams.rq

----------------
| team         |
================
| :ArsenalFC   |
| :ChelseaFC   |
| :LiverpoolFC |
----------------
</code></pre><p>Great. Now we have data going to and from our triple store, let&rsquo;s expand our graph with some other interesting data. Put this in a file  <code>add_players.rq</code> and send it to Blazegraph the same as before.</p>
<pre tabindex="0"><code>PREFIX s: &lt;http://tempuri.com/soccer/&gt;
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
PREFIX foaf: &lt;http://xmlns.com/foaf/0.1/&gt;

INSERT DATA {
    s:BerndLeno a s:Footballer;
        foaf:givenName &quot;Bernd&quot;;
        foaf:familyName &quot;Leno&quot;.

    s:HectorBellerin a s:Footballer;
        foaf:givenName &quot;Hector&quot;;
        foaf:familyName &quot;Bellerin&quot;.

    s:KieranTierney a s:Footballer;
        foaf:givenName &quot;Kieran&quot;;
        foaf:familyName &quot;Tierney&quot;.

    s:KepaArrizabalaga a s:Footballer;
        foaf:givenName &quot;Kepa&quot;;
        foaf:familyName &quot;Arrizabalaga&quot;.

    s:AntonioRudiger a s:Footballer;
        foaf:givenName &quot;Antonio&quot;;
        foaf:familyName &quot;Rudiger&quot;.

    s:MarcosAlonso a s:Footballer;
        foaf:givenName &quot;Marcos&quot;;
        foaf:familyName &quot;Alonso&quot;.

    s:Alisson a s:Footballer;
        foaf:givenName &quot;Alisson&quot;.

    s:NathanielClyne a s:Footballer;
        foaf:givenName &quot;Nathaniel&quot;;
        foaf:familyName &quot;Clyne&quot;.

    s:Fabinho a s:Footballer;
        foaf:givenName &quot;Fabinho&quot;.
}
</code></pre><p>We should now be able to pull back the player data. Again, create an  <code>rq</code> file and send it to Blazegraph using  <code>rsparql </code>.</p>
<pre tabindex="0"><code>PREFIX s: &lt;http://tempuri.com/soccer/&gt;

SELECT ?player
WHERE {
    ?player a s:Footballer .
}
LIMIT 10
</code></pre><pre tabindex="0"><code>rsparql --service='http://localhost:8889/blazegraph/namespace/kb/sparql' --query=./queries/get_players.rq

----------------------
| player             |
======================
| s:Alisson          |
| s:AntonioRudiger   |
| s:BerndLeno        |
| s:Fabinho          |
| s:HectorBellerin   |
| s:KepaArrizabalaga |
| s:KieranTierney    |
| s:MarcosAlonso     |
| s:NathanielClyne   |
----------------------
</code></pre><h3 id="beware-of-non-unicode-tooling">Beware of non-unicode tooling</h3>
<p>All of the RDF standards are designed to be Unicode aware from the bottom up. When using Jena, though, you may find it doesn&rsquo;t understand Unicode. I initially wrote some RDF with accented characters.</p>
<pre tabindex="0"><code>    s:AntonioRüdiger a s:Footballer;
        foaf:givenName &quot;Antonio&quot;;
        foaf:familyName &quot;Rüdiger&quot;.
</code></pre><p>When I tried to update the triple store I got the following, not very useful, error message.</p>
<pre tabindex="0"><code>rupdate --service='http://localhost:8889/blazegraph/namespace/kb/sparql/update' --update=./queries/02.add-players.rq
org.apache.jena.atlas.web.HttpException: 400 - Bad Request
        at org.apache.jena.riot.web.HttpOp.exec(HttpOp.java:1093)
        at org.apache.jena.riot.web.HttpOp.execHttpPost(HttpOp.java:721)
        at org.apache.jena.riot.web.HttpOp.execHttpPost(HttpOp.java:517)
        at org.apache.jena.riot.web.HttpOp.execHttpPost(HttpOp.java:473)
        at org.apache.jena.sparql.modify.UpdateProcessRemote.execute(UpdateProcessRemote.java:81)
        at arq.rupdate.exec(rupdate.java:94)
        at arq.rupdate.exec(rupdate.java:80)
        at jena.cmd.CmdMain.mainMethod(CmdMain.java:93)
        at jena.cmd.CmdMain.mainRun(CmdMain.java:58)
        at jena.cmd.CmdMain.mainRun(CmdMain.java:45)
        at arq.rupdate.main(rupdate.java:44)
</code></pre><h3 id="gui-experiences">GUI Experiences</h3>
<p>I personally enjoy working on the CLI, but you might be more visual then me. Blazegraph provides a web based UI for you to query and update. It&rsquo;s helpful if you need to quickly explore to find out what kind of data it contains.</p>
<p><img src="https://aabs.files.wordpress.com/2019/09/image-1.png?w=955" alt="A simple UI comes out of the box with Blazegraph">{.wp-image-7382}</p>
<h3 id="querying-a-more-complex-graph">Querying a more complex graph</h3>
<p>Now let&rsquo;s link up the teams and players using contracts, so that we can show how a knowledge graph allows us to query through complex relationships.</p>
<pre tabindex="0"><code>PREFIX s: &lt;http://tempuri.com/soccer/&gt;
PREFIX xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt;

INSERT DATA
{

    [] a s:PlayerContract; s:withTeam s:ArsenalFC; s:withPlayer s:BerndLeno;
        s:from &quot;2019-01-01&quot;^^xsd:date; s:to &quot;2020-01-01&quot;^^xsd:date.
    [] a s:PlayerContract; s:withTeam s:ArsenalFC; s:withPlayer s:HectorBellerin;
        s:from &quot;2019-01-01&quot;^^xsd:date; s:to &quot;2020-01-01&quot;^^xsd:date.
    [] a s:PlayerContract; s:withTeam s:ArsenalFC; s:withPlayer s:KieranTierney;
        s:from &quot;2019-01-01&quot;^^xsd:date; s:to &quot;2020-01-01&quot;^^xsd:date.

    [] a s:PlayerContract; s:withTeam s:ChelseaFC; s:withPlayer s:KepaArrizabalaga;
        s:from &quot;2019-01-01&quot;^^xsd:date; s:to &quot;2020-01-01&quot;^^xsd:date.
    [] a s:PlayerContract; s:withTeam s:ChelseaFC; s:withPlayer s:AntonioRudiger;
        s:from &quot;2019-01-01&quot;^^xsd:date; s:to &quot;2020-01-01&quot;^^xsd:date.
    [] a s:PlayerContract; s:withTeam s:ChelseaFC; s:withPlayer s:MarcosAlonso;
        s:from &quot;2019-01-01&quot;^^xsd:date; s:to &quot;2020-01-01&quot;^^xsd:date.

    [] a s:PlayerContract; s:withTeam s:LiverpoolFC; s:withPlayer s:Alisson;
        s:from &quot;2019-01-01&quot;^^xsd:date; s:to &quot;2020-01-01&quot;^^xsd:date.
    [] a s:PlayerContract; s:withTeam s:LiverpoolFC; s:withPlayer s:NathanielClyne;
        s:from &quot;2019-01-01&quot;^^xsd:date; s:to &quot;2020-01-01&quot;^^xsd:date.
    [] a s:PlayerContract; s:withTeam s:LiverpoolFC; s:withPlayer s:Fabinho;
        s:from &quot;2019-01-01&quot;^^xsd:date; s:to &quot;2020-01-01&quot;^^xsd:date.
}
</code></pre><p>This contract data links the team with the player, allowing us to ask some more interesting questions. Let&rsquo;s start off by finding all the players who play for Arsenal.</p>
<pre tabindex="0"><code>PREFIX s: &lt;http://tempuri.com/soccer/&gt;

SELECT ?player
WHERE {
    ?player a s:Footballer .
    [] a s:PlayerContract;
        s:withTeam s:ArsenalFC;
        s:withPlayer ?player .
}
LIMIT 10
</code></pre><p>This is pretty straightforward, requiring little traversal of the graph.</p>
<pre tabindex="0"><code>rsparql --service='http://localhost:8889/blazegraph/namespace/kb/sparql' --query=./queries/arsenal_players.rq

--------------------
| player           |
====================
| s:BerndLeno      |
| s:HectorBellerin |
| s:KieranTierney  |
--------------------
</code></pre><p>Let&rsquo;s see if we can find a list of all the players in London? In fact we don&rsquo;t care about the URL of the player, just their first and last name.</p>
<pre tabindex="0"><code>PREFIX s: &lt;http://tempuri.com/soccer/&gt;
PREFIX foaf: &lt;http://xmlns.com/foaf/0.1/&gt;

SELECT ?givenName ?familyName
WHERE {
    ?player a s:Footballer ;
        foaf:givenName ?givenName;
        foaf:familyName ?familyName .
    ?team a s:Team;
        s:homeCity s:London .
    _:contract a s:PlayerContract;
        s:withTeam ?team;
        s:withPlayer ?player .
}
LIMIT 10
</code></pre><p>Remember from last time, how I mentioned that the way to think of query writing in SPARQL is to show what structures from the graph you want, providing what you know and leaving blanks (in the form of variables) for what you don&rsquo;t.</p>
<p>In the query above, the only concrete thing I provide is that the team home city must be London. From there it navigates the graph to find what matches.  <code>London - team - contract - player - givenName </code></p>
<p>The queries are now starting to look a bit less trivial.</p>
<pre tabindex="0"><code>rsparql --service='http://localhost:8889/blazegraph/namespace/kb/sparql' --query=./queries/london_players.rq

------------------------------
| givenName | familyName     |
==============================
| &quot;Antonio&quot; | &quot;Rudiger&quot;      |
| &quot;Bernd&quot;   | &quot;Leno&quot;         |
| &quot;Hector&quot;  | &quot;Bellerin&quot;     |
| &quot;Kepa&quot;    | &quot;Arrizabalaga&quot; |
| &quot;Kieran&quot;  | &quot;Tierney&quot;      |
| &quot;Marcos&quot;  | &quot;Alonso&quot;       |
------------------------------
</code></pre><p>Needless to say, it wouldn&rsquo;t be that much more difficult to link in more info about the national side these players play for. We could then ask fruity questions like &ldquo;<em>Get me the personal details of danish footballers playing for a london based club</em>&rdquo;.</p>
<h2 id="summary">Summary</h2>
<p>I&rsquo;ve shown in this installment how to fire up a proper triple store using Docker and insert and retrieve data from it using the CLI tools. I showed how you can incrementally build up your data, and then use SPARQL to query through complex relationships with ease.</p>
<p>Next time I will do this with Amazon Neptune, which won&rsquo;t be that much different in terms of SPARQL, so I will hook up some C# code to do it for me.</p>

    </article>

    
<ul class="article-share">
  <li>
    
    <a class="resp-sharing-button__link" href="https://facebook.com/sharer/sharer.php?u=https://industrialinference.com/2019/09/knowledge-graphs-3-using-a-triple-store/" target="_blank" rel="noopener" aria-label="Facebook">
      <div class="resp-sharing-button resp-sharing-button--facebook resp-sharing-button--medium"><div aria-hidden="true" class="resp-sharing-button__icon resp-sharing-button__icon--solid">
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M18.77 7.46H14.5v-1.9c0-.9.6-1.1 1-1.1h3V.5h-4.33C10.24.5 9.5 3.44 9.5 5.32v2.15h-3v4h3v12h5v-12h3.85l.42-4z"/></svg></div>Facebook</div>
    </a>
  </li>
  <li>
    
    <a class="resp-sharing-button__link" href="https://twitter.com/intent/tweet/?text=Knowledge%20Graphs%203%20-%20Using%20a%20Triple%20Store%20-%20The%20Wandering%20Glitch&amp;url=https://industrialinference.com/2019/09/knowledge-graphs-3-using-a-triple-store/" target="_blank" rel="noopener" aria-label="Twitter">
      <div class="resp-sharing-button resp-sharing-button--twitter resp-sharing-button--medium"><div aria-hidden="true" class="resp-sharing-button__icon resp-sharing-button__icon--solid">
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M23.44 4.83c-.8.37-1.5.38-2.22.02.93-.56.98-.96 1.32-2.02-.88.52-1.86.9-2.9 1.1-.82-.88-2-1.43-3.3-1.43-2.5 0-4.55 2.04-4.55 4.54 0 .36.03.7.1 1.04-3.77-.2-7.12-2-9.36-4.75-.4.67-.6 1.45-.6 2.3 0 1.56.8 2.95 2 3.77-.74-.03-1.44-.23-2.05-.57v.06c0 2.2 1.56 4.03 3.64 4.44-.67.2-1.37.2-2.06.08.58 1.8 2.26 3.12 4.25 3.16C5.78 18.1 3.37 18.74 1 18.46c2 1.3 4.4 2.04 6.97 2.04 8.35 0 12.92-6.92 12.92-12.93 0-.2 0-.4-.02-.6.9-.63 1.96-1.22 2.56-2.14z"/></svg></div>Twitter</div>
    </a>
  </li>
</ul>


    <ul class="pager article-pager">
      <li class="pager-newer">
          <a href="/2019/09/knowledge-graphs-2-playing-on-the-cli/" data-toggle="tooltip" data-placement="top" title="Knowledge Graphs 2 - Playing on the CLI">&lt; Newer</a>
      </li>
      <li class="pager-older">
        <a href="/2019/09/knowledge-graphs-101/" data-toggle="tooltip" data-placement="top" title="Knowledge Graphs 101">Older &gt;</a>
      </li>
    </ul>
  </div>


<div class="site-footer">
  <div class="copyright">Andrew Matthews</div>
  <ul class="site-footer-items">
  </ul>
  <div class="powerdby">
    Powered by <a href="https://gohugo.io/">Hugo</a> and <a href="https://github.com/taikii/whiteplain">Whiteplain</a>
  </div>
</div>


</body>
</html>
